performance-tests/reports/23127031_Spike_20260815_Console.txt
========================================================================
EShop Performance Test - SPIKE TEST RUN REPORT
Scenario: 23127031_Spike_20260815
Executed At: 2026-08-15T11:55:47.176Z
Report Format: Raw Console & Metric Summary Log (Listener Type 3)
========================================================================

      █ auth

        ✓ login status is 200
        ✓ login token exists

      █ read

        ✓ search status is 200
        ✓ search returns array
        ✓ detail status is 200
        ✓ detail returns product object
        ✓ orders history status is 200
        ✓ orders history is array

      █ transactional

        ✓ add to cart status is 200
        ✓ checkout status is 200
        ✓ checkout returns orderId

      checks.........................: 100.00% ✓ 11       ✗ 0  
      data_received..................: 3.0 kB  227 B/s
      data_sent......................: 1.4 kB  106 B/s
      group_duration.................: avg=10.14ms min=3.11ms med=3.89ms max=29.67ms p(90)=22.01ms  p(95)=25.84ms 
      http_req_blocked...............: avg=85.41µs min=0s     med=0s     max=512.5µs p(90)=256.25µs p(95)=384.37µs
      http_req_connecting............: avg=0s      min=0s     med=0s     max=0s      p(90)=0s       p(95)=0s      
      http_req_duration..............: avg=6.49ms  min=1.02ms med=2.59ms max=28.06ms p(90)=15.59ms  p(95)=21.83ms 
        { expected_response:true }...: avg=6.49ms  min=1.02ms med=2.59ms max=28.06ms p(90)=15.59ms  p(95)=21.83ms 
    ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 6  
      http_req_receiving.............: avg=87.35µs min=0s     med=0s     max=524.1µs p(90)=262.05µs p(95)=393.07µs
      http_req_sending...............: avg=86.36µs min=0s     med=0s     max=518.2µs p(90)=259.1µs  p(95)=388.65µs
      http_req_tls_handshaking.......: avg=0s      min=0s     med=0s     max=0s      p(90)=0s       p(95)=0s      
      http_req_waiting...............: avg=6.32ms  min=1.02ms med=2.33ms max=28.06ms p(90)=15.59ms  p(95)=21.83ms 
      http_reqs......................: 6       0.459785/s
      iteration_duration.............: avg=13.04s  min=13.04s med=13.04s max=13.04s  p(90)=13.04s   p(95)=13.04s  
      iterations.....................: 1       0.076631/s
      vus............................: 1       min=1      max=1
      vus_max........................: 1       min=1      max=1